[
    ["An older employee was repeatedly passed over for promotions in favor of younger colleagues.", "age discrimination"],
    ["A job applicant was told they were 'overqualified' for a position, which was code for being too old.", "age discrimination"],
    ["An employee was denied training opportunities because of their age.", "age discrimination"],
    ["A female employee was paid less than her male counterparts for the same job.", "gender discrimination"],
    ["A woman was denied a promotion because of assumptions about her ability to balance work and family.", "gender discrimination"],
    ["A transgender employee faced harassment and exclusion from team activities.", "gender discrimination"],
    ["An employee of color was consistently overlooked for leadership positions.", "racial discrimination"],
    ["A job applicant with a non-Western sounding name received fewer interview callbacks.", "racial discrimination"],
    ["A company culture favored employees of a certain racial background, leading to exclusion and marginalization.", "racial discrimination"],
    ["An employee with a visible disability faced mockery and ridicule from coworkers.", "disability discrimination"],
    ["An employer refused to provide reasonable accommodations for a worker with a disability.", "disability discrimination"],
    ["A job candidate was rejected because of assumptions about their ability to perform tasks due to a disability.", "disability discrimination"],
    ["A gay employee faced derogatory comments and harassment in the workplace.", "sexual orientation discrimination"],
    ["An LGBTQ+ individual was denied partnership benefits available to heterosexual couples.", "sexual orientation discrimination"],
    ["A transgender employee faced discrimination in restroom access and healthcare coverage.", "sexual orientation discrimination"],
    ["An employee was denied time off for religious holidays despite making the request in advance.", "religious discrimination"],
    ["A Sikh employee was told to remove their turban at work, which is a religious requirement.", "religious discrimination"],
    ["An employer refused to accommodate a Muslim employee's request for prayer breaks.", "religious discrimination"],
    ["An immigrant employee faced derogatory remarks and stereotypes about their nationality.", "national origin discrimination"],
    ["A non-native English speaker was mocked for their accent and language proficiency.", "national origin discrimination"],
    ["An employer favored employees of a certain nationality for promotions and opportunities.", "national origin discrimination"],
    ["A pregnant employee was denied accommodations such as a comfortable chair or restroom breaks.", "pregnancy discrimination"],
    ["A new mother faced negative comments and assumptions about her commitment to her job.", "pregnancy discrimination"],
    ["A woman was demoted or overlooked for career advancement after announcing her pregnancy.", "pregnancy discrimination"],
    ["An employee caring for an elderly parent was denied flexible work arrangements.", "caregiver discrimination"],
    ["A single parent faced challenges balancing work responsibilities with childcare.", "caregiver discrimination"],
    ["An employee was penalized for taking time off to care for a sick child or family member.", "caregiver discrimination"],
    ["An employee was subjected to comments about their weight or physical appearance.", "appearance discrimination"],
    ["A person with tattoos or piercings faced discrimination in hiring or promotions.", "appearance discrimination"],
    ["An individual with a visible disability faced bias or stigma based on their appearance.", "appearance discrimination"],
    ["An older employee received mentorship opportunities to enhance their skills and advance in their career.", "age discrimination"],
    ["A job applicant was considered based on their qualifications rather than age-related stereotypes.", "age discrimination"],
    ["An employee of color was recognized and rewarded for their contributions to the company.", "racial discrimination"],
    ["A job candidate with a disability received accommodations during the interview process to showcase their abilities.", "disability discrimination"],
    ["An LGBTQ+ individual received support and acceptance from coworkers and management.", "sexual orientation discrimination"],
    ["An immigrant employee's cultural background was valued and celebrated in the workplace.", "national origin discrimination"],
    ["A pregnant employee was provided with necessary accommodations and support throughout their pregnancy.", "pregnancy discrimination"],
    ["An employee caring for an elderly parent received flexible work arrangements to manage their responsibilities.", "caregiver discrimination"],
    ["An individual's physical appearance was not a factor in their performance evaluation or career advancement opportunities.", "appearance discrimination"]
]
