[
    ["An employee was passed over for a promotion despite having more experience and qualifications than the person who was promoted.", "discrimination"],
    ["A company refused to hire an applicant because of their age, even though they were qualified for the position.", "age discrimination"],
    ["An employer made derogatory comments about a worker's disability and refused to provide reasonable accommodations.", "disability discrimination"],
    ["A pregnant employee was demoted and given fewer responsibilities because the employer assumed she wouldn't be able to handle the workload.", "pregnancy discrimination"],
    ["An employee was harassed by their supervisor because of their sexual orientation, leading to a hostile work environment.", "sexual orientation discrimination"],
    ["A transgender employee was denied access to the restroom that aligns with their gender identity, causing distress and discomfort.", "gender identity discrimination"],
    ["An employee was unfairly terminated after reporting instances of racial discrimination in the workplace.", "racial discrimination"],
    ["A worker was paid less than their colleagues for doing the same job because of their gender.", "gender discrimination"],
    ["An employee with a religious head covering was told they could not wear it at work, despite it being part of their religious practice.", "religious discrimination"],
    ["A Filipino worker was subjected to derogatory remarks and stereotypes about their nationality by coworkers.", "national origin discrimination"],
    ["An employer implemented a policy that disproportionately affected employees with disabilities, making it difficult for them to perform their jobs.", "disability discrimination"],
    ["A company refused to provide sign language interpreters for deaf employees during meetings and training sessions.", "disability discrimination"],
    ["An employee was denied a promotion because they requested time off for medical treatment related to a chronic illness.", "disability discrimination"],
    ["A pregnant worker was denied access to maternity leave and was forced to continue working despite experiencing complications.", "pregnancy discrimination"],
    ["An employee was subjected to unwanted advances and inappropriate comments by a supervisor, creating a hostile work environment.", "sexual harassment"],
    ["A transgender employee was repeatedly misgendered and called derogatory slurs by coworkers.", "gender identity discrimination"],
    ["An employee was excluded from team activities and social events because of their race.", "racial discrimination"],
    ["A worker was denied a job opportunity because they did not conform to traditional gender norms.", "gender discrimination"],
    ["An employer refused to accommodate an employee's religious practices and scheduled mandatory meetings during religious holidays.", "religious discrimination"],
    ["An employee with a mental health condition was mocked and ridiculed by coworkers, creating a hostile work environment.", "disability discrimination"],
    ["A company implemented a policy requiring employees to undergo unnecessary medical examinations that targeted individuals with certain health conditions.", "disability discrimination"],
    ["An employee was denied access to training and development opportunities because they used a wheelchair.", "disability discrimination"],
    ["A pregnant worker was denied access to restroom breaks and water during long shifts, leading to health complications.", "pregnancy discrimination"],
    ["An employee was subjected to lewd comments and gestures by a coworker, despite repeatedly asking them to stop.", "sexual harassment"],
    ["A transgender employee was denied access to gender-affirming healthcare coverage by their employer's insurance plan.", "gender identity discrimination"],
    ["An employee of Filipino descent was unfairly disciplined for minor infractions while their non-Filipino coworkers received leniency for similar behavior.", "national origin discrimination"],
    ["A worker was repeatedly passed over for promotions because they did not fit the company's stereotypical image of leadership.", "gender discrimination"],
    ["An employer terminated an employee after they requested reasonable accommodations for their religious practices.", "religious discrimination"],
    ["An employee with a mental health condition was subjected to stigmatizing remarks and assumptions about their abilities by coworkers and supervisors.", "disability discrimination"],
    ["A company refused to make accommodations for an employee with a disability, claiming it would be too costly and burdensome.", "disability discrimination"],
    ["An employer implemented a policy that required employees to work mandatory overtime shifts, despite knowing that it would negatively impact workers with caregiving responsibilities.", "caregiver discrimination"],
    ["A transgender employee was excluded from company-sponsored healthcare plans that covered gender-affirming medical treatments.", "gender identity discrimination"],
    ["An employee was unfairly terminated after filing a complaint about racial discrimination and harassment in the workplace.", "retaliation"],
    ["A pregnant worker was denied opportunities for career advancement and challenging assignments because of assumptions about their commitment to their career.", "pregnancy discrimination"],
    ["An employee was denied a promotion because they requested a flexible work schedule to accommodate their caregiving responsibilities.", "caregiver discrimination"],
    ["A transgender employee was refused access to gender-appropriate uniforms and was required to wear clothing that did not align with their gender identity.", "gender identity discrimination"],
    ["An employee was subjected to derogatory remarks and stereotypes about their age by younger coworkers.", "age discrimination"],
    ["A company refused to hire an applicant because they were perceived as being too young and lacking experience, despite meeting all the qualifications for the position.", "age discrimination"],
    ["An employee with a disability was denied access to training and professional development opportunities because of assumptions about their capabilities.", "disability discrimination"],
    ["A pregnant worker was denied access to restroom facilities and was told to 'hold it' by their supervisor, leading to discomfort and embarrassment.", "pregnancy discrimination"],
    ["An employer implemented a dress code policy that targeted specific religious attire worn by employees.", "religious discrimination"],
    ["A Filipino worker was excluded from team meetings and decision-making processes by their non-Filipino coworkers.", "national origin discrimination"],
    ["An employee with a visible disability was denied access to essential workplace facilities and accommodations.", "disability discrimination"],
    ["A company refused to provide sign language interpreters for deaf employees during mandatory training sessions.", "disability discrimination"],
    ["An employee was denied a promotion because they did not fit the company's stereotype of an ideal employee based on physical appearance.", "appearance discrimination"],
    ["A transgender worker was misgendered and referred to by their previous name by coworkers and supervisors, despite their request for respectful treatment.", "gender identity discrimination"],
    ["An employee was terminated after filing a complaint about sexual harassment in the workplace.", "retaliation"],
    ["A pregnant worker was denied access to job assignments and responsibilities that would have allowed for career growth and development.", "pregnancy discrimination"],
    ["An employer implemented a policy requiring employees to provide documentation of their marital status for family-related benefits, leading to discrimination against unmarried individuals.", "marital status discrimination"],
    ["An employee with a mental health condition was unfairly disciplined for taking breaks to manage their symptoms, despite providing documentation from a healthcare professional.", "disability discrimination"],
    ["A company refused to hire an applicant because they were a single parent, assuming that they would be unreliable and unable to commit to the job.", "caregiver discrimination"],
    ["An employee was denied access to training opportunities because they had taken extended leave for family caregiving responsibilities.", "caregiver discrimination"],
    ["An employee was denied a promotion because of their ethnicity, despite meeting all the qualifications and performance standards.", "racial discrimination"],
    ["A company refused to hire an applicant because they had a visible tattoo, citing it as unprofessional.", "appearance discrimination"],
    ["An employer made derogatory comments about a worker's accent and language proficiency, creating a hostile work environment.", "national origin discrimination"],
    ["A pregnant employee was excluded from important meetings and decision-making processes, despite her role and expertise.", "pregnancy discrimination"],
    ["An employee was denied access to training and development opportunities because they were part of a union.", "union activity discrimination"],
    ["A company implemented a policy that favored employees of a certain political affiliation, excluding others from opportunities and benefits.", "political affiliation discrimination"],
    ["An employee was subjected to harassment and discrimination after disclosing their sexual orientation to coworkers.", "sexual orientation discrimination"],
    ["A transgender worker was denied access to restroom facilities at their workplace, leading to discomfort and health issues.", "gender identity discrimination"],
    ["An employee with a disability was denied a reasonable accommodation, leading to difficulties in performing job tasks.", "disability discrimination"],
    ["A pregnant worker was assigned menial tasks and given fewer responsibilities, despite her qualifications and experience.", "pregnancy discrimination"],
    ["An employer refused to provide paid parental leave to new fathers, creating disparities in benefits based on gender.", "gender discrimination"],
    ["An employee was terminated after requesting a religious holiday off, despite providing advance notice and making arrangements for coverage.", "religious discrimination"],
    ["An employee was repeatedly overlooked for team leadership roles because of their ethnicity, despite demonstrating strong leadership skills and performance.", "racial discrimination"],
    ["A qualified candidate was denied a job offer solely because they wore a hijab, despite being the most qualified applicant.", "religious discrimination"],
    ["An employee was mocked and ridiculed by coworkers for their accent and cultural background, creating a hostile work environment.", "national origin discrimination"],
    ["A transgender employee was denied access to the company's healthcare plan because it did not cover gender-affirming treatments, despite those treatments being medically necessary.", "gender identity discrimination"],
    ["An employee with a physical disability was denied a promotion because the employer assumed they wouldn't be able to handle the responsibilities, despite their proven track record of success.", "disability discrimination"],
    ["A pregnant worker was excluded from important meetings and decision-making processes, despite her expertise and role in the project.", "pregnancy discrimination"],
    ["An employee who identifies as non-binary was harassed and belittled by coworkers for not conforming to traditional gender norms, creating a hostile work environment.", "gender discrimination"],
    ["A company refused to provide reasonable accommodations for an employee's religious practices, such as prayer breaks, despite accommodating other non-religious requests.", "religious discrimination"],
    ["An employee who is a caregiver for their elderly parent was denied flexible work hours to accommodate their caregiving responsibilities, despite it being feasible for the company.", "caregiver discrimination"],
    ["An employee who is a member of a labor union was unfairly targeted for disciplinary actions and denied training opportunities, solely because of their union affiliation.", "union activity discrimination"]
]

